export const ua = {
  nav: {
    rules: 'Правила',
    language: 'Змінити мову',
    admin: 'Адмінка',
    login: 'Увійти',
  },

  homePage: {
    aboutGame:
      'Представляємо "Civ Monopoly" — покрокову стратегічну гру, ' +
      'що поєднує найкращі елементи Civilization VI зі світом Monopoly! ' +
      'Уявіть собі: ви будуєте власну економічну імперію, ' +
      'придбаєте майно та створюєте монополії, ' +
      'паралельно керуючи дипломатією та війною. ' +
      'Гра має великі ризики, гравці повинні ' +
      'збалансовувати свої бізнес-амбіції з військовою потужністю, ' +
      'адже суперники можуть вторгнутися на ваші території ' +
      'та захопити ваші активи.',
  },
  rulesPage: {
    mainRulesH: 'Основи гри:',
    mainRulesP1:
      'В грі є три інтерфейси: зліва показані гравці ' +
      'та їхні характеристики, по центру поле з всім  ' +
      'змістом, справа йде зона де ти менеджиш ' +
      'та вирішуєш якісь справи.',

    mainRulesP2:
      'Впливати на гру ти можеш тільки під час свого ходу. На ' +
      'початку хода ти кидаєш кубик і тобі приходить якийсь ' +
      'івент відносно того куди ти потрапив. Хід не закінчується лише на івентах, ' +
      'які треба обов’язково виконувати, типу купити клітинку, ' +
      'заплатити, пропустити, а також є вкладка менеджменту ' +
      'де ти можеш приймати якісь рішення по дипломатії чи імперії по типу:  ' +
      'заложити клітинку, прокачати клітинку, ' +
      'надіслати запит на союз, надіслати делегацію. ',

    mainRulesP3:
      'В грі є механіка війни, де ти маєш забезпечувати свою ' +
      'армію та нарощувати її для сили імперії. При нападі ' +
      'буде важче виграти бій, так як на обороні є безліч модифікаторів. ',

    mainRulesP4:
      'На початку кожного ходу також ти отримуєш золото, ' +
      'а в кінці ходу відносно того яку ти вибрав воєнну економіку ' +
      'а в кінці ходу відносно того яку ти вибрав воєнну економіку',

    mainRulesP5:
      'На початку кожного вашого ходу буде кнопка “кинути кубики”, ' +
      'нею ви кидаєте два кубики і відносно ' +
      'того скільки випало очок на двох кубиках, ви проходите туж кількість клітинок.',

    mainRulesP6:
      'В грі є 4 види перемоги: воєнна, культурна, наукова, по очкам. ' +
      'Ти маєш балансувати між ними, щоб досягнути оптимального результату.',

    mainRulesP7:
      'Є 5 варіантів клітинок на які ти можеш стати: звичайна, де івент ' +
      'залежить від того кому належить клітинка, варвари та племені поселення ' +
      'які дають один з багатьох заготовлених позитивних та негативних івентів, клітинка проектів ' +
      'які дають один з багатьох заготовлених позитивних та негативних івентів, клітинка проектів ' +
      'старт який не дає ніякого івенту, але коли ти проходиш через нього тобі дають золото за коло.',

    mainRulesP8:
      'Гра включає в себе вибір героя, які дають додатковий контент в вигляді ' +
      'унікальних вмінь та районів. Лідери роблять різноманіття геймплею в ваших сесіях.',

    rulesDetailsH: 'Подробиці про гру:',

    cell: 'Клітинка:',

    rulesDetailsP1:
      ' Для придбання клітинки треба стояти на ній, мати достатньо золота та виконати умову якщо вона є. ' +
      'Якщо ти потрапляєш на свою клітинку ніякого івенту не станеться. Якщо потрапиш на чужу клітинку потрібно буде заплатити золото, ' +
      'або почати воювати з лідером. При потраплянні на ворожу клітинку ти можеш прийняти бій чи спробувати втекти з шансом 50%.',

    rulesDetailsP2:
      'Клітинки можуть мати якісь ефекти дивлячись від того скільки апгрейдів в тебе є. Також клітинки можуть прокачуватися ' +
      'від того шо на неї діє якийсь ефект з іншої клітинки, за бонус сусідства як наприклад мати три ферми.',

    rulesDetailsP3:
      'Ви можете закладати клітинки та їх апгрейди, за пів ціни. Якщо ви заклали клітинку, то вона відпаде від вас за 5 ходів, але цього можна уникнути викупивши її за 70%. ' +
      'Поки ця клітинка є закладена, вона нічого не приносить.',

    rulesDetailsP4:
      'Воєнний табір має унікальний вид оплати за крок, потрапивши на нього, гравець має заплатити кількість золота в залежності від пройденої відстані. ' +
      'При війні це міняється на кількість втрат армії відносно пройденої відстані. ' +
      'Також коли ви потрапляєте на воєнний табір у вас шанс уникнути бою стає 20% замість 50%.',

    rulesDetailsP5:
      'Для прокачки клітинки потрібно виконувати умову. Зазвичай це буде щось типу: почекати n-кількість ходів, дійти до n-го ходу, ' +
      'пройти коло на карті, досягнути якоїсь кількості культури чи армії і тд...',

    rulesDetailsP6:
      'Також є унікальний район під назвою урядова плаща в якого на прокачках крім умов є ще вибір останньої будівлі яка йде спеціалізована на якусь з основних перемог.',

    war: 'Війна:',

    rulesDetailsP7:
      ' В цілому основним джерелом нарощування армії є витрати на армію. Де ви просто вибираєте яку політику ви хочете і воно знімає в кінці ходу золото і дає силу армії. ' +
      'Ці витрати на армію можуть прокачувати за допомогою ефектів воєнного табору та альбагамри.',

    rulesDetailsP8:
      'При захисті ідуть модифікатори   в залежності від того на скільки прокачений район, воно просто надає додаткові одиниці сили. ' +
      'Після бою звісно будуть втрати в залежності від того хто на скільки фатально програв бій. Якщо атакуючий виграв, то з шансом 80% клітинка стане білою, тобто нічийною, ' +
      'а з 20% нападаючий отримає її собі, але та клітинка не матиме ніяких будівель  всередині.',

    rulesDetailsP9:
      'Після 5 ходів війни ви можете заключити мир, а саме в вкладці менеджменту на свій ход один з учасників конфлікту має кинути пропозицію миру. ' +
      'Ця пропозиція прийде перед початком ходу тому кому відправили.',

    union: 'Союз:',

    rulesDetailsP10:
      ' Ви можете на свій хід кинути в менеджменті заявку на союз, яка прийде для того в кого запрошують перед ходом. ' +
      'При союзі ви не платите золото один одному коли наступаєте на клітинки союзника. ' +
      'Також ви отримуєте додаткове золото в хід. Можна мати лише один союз і почати будувати союз після 10 ходу.',

    goldPerTurn: 'Золото в хід:',

    rulesDetailsP11:
      ' Це золото яке ви отримуєте на початку ходу, цей параметр росте в залежності від того на скільки у вас прогресивні клітинки, ' +
      'також додаткове золото в хід приходить від альянсу. Також цей показник може бути навіть негативно так які в себе він і включає витрати, наприклад на армію чи від кількості армії. ' +
      'Детальну статистику по свому доходу ти може переглянути натиснувши на іконку золота в хід',
  },

  authentication: {
    signUp: 'Зареєструватись',
    signIn: 'Увійти',
    userName: "Ім'я користувача",
    confirmPassword: 'Підтвердити пароль',
    password: 'Пароль',
    alreadyHave: 'Вже маєте акаунт? Увійти',
    haveNotAccount: 'Ще не маєте акаунта? Зареєструйтесь',
  },
  lobby: {
    lobbies: 'Кімнати',
    create: 'Створити',
    gameStarted: 'Гра почалась',
    leave: 'Покинути',
    moveToLobby: 'Перейти в кімнату',
    dialogCreate: {
      lobbyName: 'Назва кімнати:',
      sizeLabel: 'Розмір (2–6):',
      password: 'Пароль:',
      create: 'Створити',
      join: 'Приєднатися',
    },
  },
  admin: {
    serverStatus: 'Статус сервера:',
    id: 'ID',
    nickname: 'Нікнейм',
    username: 'Користувач',
    email: 'Емейл',
    achievements: 'Досягнення',
    elo: 'Elo',
    matchesPlayed: 'Матчі',
    matchesWon: 'Перемог',
    averagePlacement: 'Середнє',
    change: 'Змінити',
    errorOccurred: 'Сталася помилка',
    modal: {
      deleteAvatar: 'Видалити аватар',
      hisMessages: 'Його повідомлення',
      banTime: 'Час блокування',
      banMessage: 'Останнє слово',
      banAccount: 'Заблокувати акаунт',
      deleteAccount: 'Видалити акаунт',
      errorOccurred: 'Сталася помилка',
      nickname: 'Нікнейм',
      username: 'Ім’я користувача',
      email: 'Емейл',
      changePassword: 'Змінити пароль',
      elo: 'Ело',
      games: 'Ігор',
      wins: 'Перемог',
      average: 'Середнє',
      updateProfile: 'Оновити профіль',
      reset: 'Скинути',
      close: 'Закрити',
    },
  },
  errorPages: {
    forbidden: 'У вас немає доступу до цього ресурсу',
    notFound: 'Сторінку не знайдено',
  },
  maintenance: {
    tehIssues: 'Можливі технічні несправності',
    rottedPotatoes: 'Деякі картоплини зіпсувалися й потребують заміни',
  },
  profile: {
    errorOccurred: 'Сталася помилка',
    notFoundMessagePrefix: "Користувача з нікнеймом '",
    notFoundMessageSuffix: "' не знайдено",
    privateProfileClass: 'твій-профіль', // або залишити без перекладу, якщо це CSS клас
  },
  notification: {
    clearAll: 'Почистити все',
  },
  chat: {
    loading: 'Загрузка...',
    noContacts: 'Немає контактів',
    findUser: 'Шукати',
    noMessages: 'Повідомлення відсутні',
    public: 'Публічний чат',
  },
};
